Revit 2027 API
ConcreteBrightmodeType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteBrightmode" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConcreteBrightmodeType
Public Enumeration ConcreteBrightmodeType
public enum class ConcreteBrightmodeType
type ConcreteBrightmodeType
Members
Member name | Value | Description
Automatic | 1
Custom | 2
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace